In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
pd.options.display.float_format = '{:,.3f}'.format

In [16]:
df = sns.load_dataset('tips')
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0      16.990 1.010  Female     No  Sun  Dinner     2
1      10.340 1.660    Male     No  Sun  Dinner     3
2      21.010 3.500    Male     No  Sun  Dinner     3
3      23.680 3.310    Male     No  Sun  Dinner     2
4      24.590 3.610  Female     No  Sun  Dinner     4
5      25.290 4.710    Male     No  Sun  Dinner     4
6       8.770 2.000    Male     No  Sun  Dinner     2
7      26.880 3.120    Male     No  Sun  Dinner     4
8      15.040 1.960    Male     No  Sun  Dinner     2
9      14.780 3.230    Male     No  Sun  Dinner     2

In [4]:
df.groupby(['sex','time'])[['total_bill']].mean()

               total_bill
sex    time
Male   Lunch       18.048
       Dinner      21.461
Female Lunch       16.339
       Dinner      19.213

In [5]:
df_gp = df.groupby(['sex','time'])[['total_bill']].mean().reset_index()

In [6]:
df_gp

      sex    time  total_bill
0    Male   Lunch      18.048
1    Male  Dinner      21.461
2  Female   Lunch      16.339
3  Female  Dinner      19.213

In [7]:
df_gp.pivot_table(values='total_bill',index='sex',columns='time')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

![](https://pandas-docs.github.io/pandas-docs-travis/_images/reshaping_pivot.png)

In [8]:
df.pivot_table(values='total_bill',index='sex',columns='time')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

### Internamente en pivot se aplica una función agregada de la media, basicamente lo que esta realizando la función es volver columnas las observaciones del dataframe

In [22]:
def porcentaje(x):
    return x/x.sum()*100

In [37]:
df_prc = df.pivot_table(values='total_bill',index=['sex','smoker'], aggfunc=np.sum)
df_prc

               total_bill
sex    smoker
Male   Yes      1,337.070
       No       1,919.750
Female Yes        593.270
       No         977.680

In [39]:
df_prc.groupby(['sex','smoker']).apply(lambda x: x.sum()/100)

               total_bill
sex    smoker
Male   Yes         13.371
       No          19.197
Female Yes          5.933
       No           9.777

In [12]:
df_pivot = df.pivot_table(values='total_bill',index='sex',columns='time', aggfunc=[np.median,np.std])

In [15]:
df_pivot.unstack().reset_index()

  level_0    time     sex      0
0  median   Lunch    Male 16.580
1  median   Lunch  Female 13.420
2  median  Dinner    Male 19.630
3  median  Dinner  Female 17.190
4     std   Lunch    Male  7.953
5     std   Lunch  Female  7.501
6     std  Dinner    Male  9.461
7     std  Dinner  Female  8.202

In [ ]:
df.pivot_table(values='total_bill',index='sex',columns='time')

In [2]:
import numpy as np
np.array([10,8,5,0]) * np.array([0,1,6,12])

array([ 0,  8, 30,  0])